day_dict = {
    'Monday': 'Δευτέρα',
    'Tuesday': 'Τρίτη',
    'Wednesday': 'Τετάρτη',
    'Thursday': 'Πέμπτη',
    'Friday': 'Παρασκευή',
    'Saturday': 'Σάββατο',
    'Sunday': 'Κυριακή',
}   

month_dict = {'01': 'Ιανουαρίου',
 '02': 'Φεβρουαρίου',
 '03': 'Μαρτίου',
 '04': 'Απριλίου',
 '05': 'Μαϊου',
 '06': 'Ιουνίου',
 '07': 'Ιουλίου',
 '08': 'Αυγούστου',
 '09': 'Σεπτεμεβρίου',
 '10': 'Οκτωβρίου',
 '11': 'Νοεμβρίου',
 '12': 'Δεκεμβρίου'}

hours = [
    '14:00 μ.μ', 
    '14:15 μ.μ', 
    '14:30 μ.μ',
    '14:45 μ.μ',
    '15:00 μ.μ',
    '15:10 μ.μ',
    '15:30 μ.μ',
    '15:40 μ.μ',
    '15:50 μ.μ',
    '16:00 μ.μ',
    '16:10 μ.μ'
]

martyras1a = r"Έχω άδεια ασκήσεως επαγγέλματος ηλεκτρολόγου και μηχανολόγου. Έχω σπουδάσει στην σχολή Μηχανολόγων και Μηχανικών του Εθνικού Μετσόβιου Πολυτεχνείου, είμαι μέλος του Τεχνικού Επιμελητηρίου Ελλάδος "
martyras1b = r"(ΑΜ 33220) και διατηρώ τεχνικό γραφείο ηλεκτρολογικών μελετών και εγκαταστάσεων, ενώ εργάζομαι ως ηλεκτρολόγος μηχανολόγος από το έτος 1981"
martyras1c = r"Πετρόπουλος Κωνσταντίνος του Χρήστου, επάγγελμα ηλεκτρολόγος μηχανικός,  κάτοικος Γκιώνας 32, Κερατσίνι Αττικής με ΑΦΜ  150447165 και ΑΔΤ ΑΤ: Χ031744/01-10-2002 "
martyras2a  =r"Έχω άδεια ασκήσεως επαγγέλματος ηλεκτρολόγου τεχνολόγου Β' Τάξης (αριθμός Αδείας 1136/ΔΤ). Έχω σπουδάσει στο Τεχνολογικό Εκπαιδευτικό 'Ίδρυμα Κρήτης "
martyras2b = r"""και ασκώ το επάγγελμά μου από το έτος 2013, επί του παρόντος δε, απασχολούμαι στην επιχείρηση παροχής υπηρεσιών ηλεκτρολόγου "SPK ENGINEERING" """
martyras2c = r"Αναστάσιος Ευσταθίου του Νικολάου, επάγγελμα ηλεκτρολόγος μηχανολόγος,  κάτοικος Ηλιούπολης, οδός Ανδρούτσου 3 με ΑΦΜ  026876429, Δ.Ο.Υ. Ηλιούπολης και ΑΔΤ ΑΚ 563555/14-06-2012, Τ.Α. Ηλιούπολης"

AITHOUSA = "στον 2ο όροφο, Αίθουσα Λέοντος Σοφού "


date_katathesi_options= ["Κατάθεση μικροδ ΝΚΠολ Δ",'Ημ νια Κατάθεσης Αγωγής ΝΚπολ Δ']