

df4 = pd.DataFrame()
df4['Αντίδικος 1'] = "ΚΕΝΟ"
df4['Μορφ.αντίδικος 1'] = df3['Αντίδικος_1'] + " "
df4['Αντίδικος 2'] = "ΚΕΝΟ"
df4['Μορφ.αντίδικος 2'] = df3['Αντίδικος_2'] + " "
df4['Αντίδικος 3'] = "ΚΕΝΟ"
df4['Μορφ.αντίδικος 3'] = df3['Αντίδικος_3'] + " "
df4['Αντίδικος ένορκης'] = df3['Αντίδικος_1'].apply(lambda x : x.replace('Του ','του ').replace('Της ','της ') )
df4['Μορφ.αντίδικος ένορκης 1'] = "ΚΕΝΟ"
df4['Μορφ.αντίδικος ένορκης 2'] = "ΚΕΝΟ"


df4['ΣΥΝΟΠΤΙΚΗ ΗΜΕΡΟΜΗΝΙΑ ΕΝΟΡΚΗΣ'] = df3['Ημερομηνία_Ένορκης'].fillna("01/01/1900")

# df4['ΗΜΕΡΑ ΕΝΟΡΚΗΣ'] = df4['ΣΥΝΟΠΤΙΚΗ ΗΜΕΡΟΜΗΝΙΑ ΕΝΟΡΚΗΣ'].apply(get_day_name)
# df4['ΗΜΕΡΑ ΕΝΟΡΚΗΣ'] = df4['ΗΜΕΡΑ ΕΝΟΡΚΗΣ'].map(day_dict)
# df4['ΩΡΑ'] = hours_col
# df4['ΗΜΕΡΑ ΕΝΟΡΚΗΣ ΑΡΙΘΜΟΣ']  = df4['ΣΥΝΟΠΤΙΚΗ ΗΜΕΡΟΜΗΝΙΑ ΕΝΟΡΚΗΣ'].apply(lambda x : str(x).split("/")[0])
# df4['ΜΗΝΑΣ ΕΝΟΡΚΗΣ'] = df4['ΣΥΝΟΠΤΙΚΗ ΗΜΕΡΟΜΗΝΙΑ ΕΝΟΡΚΗΣ'].apply(lambda x : str(x).split("/")[1]).map(month_dict)
# df4['ΕΤΟΣ ΕΝΟΡΚΗΣ']  = df4['ΣΥΝΟΠΤΙΚΗ ΗΜΕΡΟΜΗΝΙΑ ΕΝΟΡΚΗΣ'].apply(lambda x : str(x).split("/")[2])
# df4['ΔΙΚΗΓΟΡΟΣ 1'] = anathesi_df['ΔΙΚΗΓΟΡΟΣ_full'].map(mapping_dikigoron) 
# df4['ΔΙΚΗΓΟΡΟΣ 2'] = anathesi_df['ΔΙΚΗΓΟΡΟΣ_full']
# df4['ΓΕΝΟΣ ΔΙΚΗΓΟΡΟΥ 1'] = np.where(df4['ΔΙΚΗΓΟΡΟΣ 1'].apply(lambda x : str(x)[:3])== 'του','Ο','Η')
# df4['ΓΕΝΟΣ ΔΙΚΗΓΟΡΟΥ 2'] = np.where(df4['ΔΙΚΗΓΟΡΟΣ 1'].apply(lambda x : str(x)[:3])== 'του',' Ο συντάξας','Η συντάξασα')
# df4['Άρρεν θήλυ']=  "ΚΕΝΟ"
# df4['ΗΜΕΡΟΜΗΝΙΑ ΑΓΩΓΗΣ'] = last_date
# df4['ΕΤΟΣ ΑΓΩΓΗΣ'] = '2023'
# df4['ΑΡΙΘΜΟΣ ΚΑΤΑΘΕΣΗΣ ΑΓΩΓΗΣ'] = np.where(df2['ΓΑΚ'] == ""," με αριθμό κατάθεσης " + df2['ΕΑΚ'] + "/" + df4['ΕΤΟΣ ΑΓΩΓΗΣ'] ," με ΓΑΚ " + df2['ΓΑΚ']+ "/" + df4['ΕΤΟΣ ΑΓΩΓΗΣ']  + ' και ΕΑΚ ' + df2['ΕΑΚ']+ "/" + df4['ΕΤΟΣ ΑΓΩΓΗΣ'] )
# df4['ΔΙΚΑΣΤΙΚΟ ΙΔΡΥΜΑ'] = anathesi_df['Δικαστικό Ίδρυμα']
# df4['ΔΙΑΔΙΚΑΣΙΑ'] = np.where(anathesi_df['Διαδικασία'] == "Τακτική Διαδικασία","Τακτική Διαδικασία ΝΚΠολΔ","Διαδικασία των Μικροδιαφορών")
# df4['ΓΕΝΟΣ ΕΝΑΓΟΜΕΝΟΥ'] = np.where(df3['Αντίδικος_2'] != "", "στους ανωτέρω εναγομένους",np.where(df3['Αντίδικος_1'].apply(lambda x: str(x[:3]))  == 'του', 'στον ανωτέρω εναγόμενο', 'στην ανωτέρω εναγομένη')) #change iorder genos anitidkou ❌❌
# df4['Άρρεν/θήλυ'] = "ΚΕΝΟ"
# df4['Αριθμός Αντιδίκων']= '-'
# df4['Αριθμός Αντιδίκων'] = np.where(df3['Αντίδικος_2']!= "",2,1)
df4['ΓΕΝΟΣ ΚΛΗΘΕΝΤΟΣ 1'] = np.where(df3['Αντίδικος_2'] != "", "Οι κληθέντες",np.where(df4['Αντίδικος 1'].apply(lambda x : str(x)[:3])== 'του', 'Ο κληθείς', 'Η κληθείσα'))
df4['ΓΕΝΟΣ ΚΛΗΘΕΝΤΟΣ 2'] = np.where(df3['Αντίδικος_2']!= "",'παραστάθηκαν','παραστάθηκε')
df4['ΓΕΝΟΣ ΚΛΗΘΕΝΤΟΣ 3'] = np.where(df3['Αντίδικος_2'] != "", "τους",np.where(df4['Αντίδικος 1'].apply(lambda x : str(x)[:3])== 'του', 'του', 'της'))
df4['ΓΕΝΟΣ ΚΛΗΘΕΝΤΟΣ 4'] = np.where(df3['Αντίδικος_2']!= "",'προέβαλαν','προέβαλε')
df4['ΔΙΚΑΣΤΙΚΟΣ ΕΠΙΜΕΛΗΤΗΣ'] = anathesi_df['Μάρτυρας']
df4['ΑΡΙΘΜΟΣ ΕΚΘΕΣΕΩΝ ΕΠΙΔΟΣΗΣ 1,ΑΡΙΘΜΟΣ ΕΚΘΕΣΕΩΝ ΕΠΙΔΟΣΗΣ 2,Υπολογισμός αριθμού εκθέσεων επίδοσης,ΕΚΘΕΣΗ ΕΠΙΔΟΣΗΣ'.split(",")] = ""
df4['ΗΜΕΡΟΜΗΝΙΑ ΚΛΗΣΗΣ'] = df3['Ημερομηνία Κλήσης']
df4['ΑΙΘΟΥΣΑ'] = AITHOUSA
df4['ΑΠΟΘΗΚΕΥΣΗ'] ="ΚΕΝΟ"
df4['ΜΑΡΤΥΡΑΣ']	= np.where(anathesi_df['Μάρτυρας'] == 'ΠΕΤΡΟΠΌΥΛΟΣ', martyras1c,martyras2c)
df4['ΜΑΡΤΥΡΑΣ 1'] = np.where(anathesi_df['Μάρτυρας'] == 'ΠΕΤΡΟΠΌΥΛΟΣ', martyras1a,martyras2a)
df4['ΜΑΡΤΥΡΑΣ 2']= np.where(anathesi_df['Μάρτυρας'] == 'ΠΕΤΡΟΠΌΥΛΟΣ', martyras1b,martyras2b)
